{
  "version": "1.0",
  "truncation": null,
  "padding": null,
  "added_tokens": [
    {
      "id": 0,
      "content": "[PAD]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 1,
      "content": "[UNK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 2,
      "content": "H",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 3,
      "content": "NH2",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    },
    {
      "id": 4,
      "content": "[MASK]",
      "single_word": false,
      "lstrip": false,
      "rstrip": false,
      "normalized": false,
      "special": true
    }
  ],
  "normalizer": null,
  "pre_tokenizer": {
    "type": "BertPreTokenizer"
  },
  "post_processor": null,
  "decoder": {
    "type": "WordPiece",
    "prefix": "##",
    "cleanup": true
  },
  "model": {
    "type": "WordPiece",
    "unk_token": "[UNK]",
    "continuing_subword_prefix": "##",
    "max_input_chars_per_word": 100,
    "vocab": {
      "[PAD]": 0,
      "[UNK]": 1,
      "H": 2,
      "NH2": 3,
      "[MASK]": 4,
      "Nlys": 5,
      "Nspe": 6,
      "Nsna": 7,
      "Nsmb": 8,
      "Nglu": 9,
      "Nrpe": 10,
      "NHis": 11,
      "Nssb": 12,
      "Npm": 13,
      "Pro": 14,
      "Nsdp": 15,
      "Ntridec": 16,
      "Nleu": 17,
      "N1Nal": 18,
      "N4MePhe": 19,
      "N4hb": 20,
      "Nile": 21,
      "NNle": 22,
      "Ntrp": 23,
      "Nae": 24,
      "Naetm+": 25,
      "Nah" : 26,
      "Nai" : 27,
      "Namy" : 28,
      "Nchtm+" : 29,
      "Nah" : 30, 
      "Nai" : 31,
      "Namy" : 32,
      "Nchtm+" :33,
      "Ndec": 34,
      "Ndpe": 35,
      "NhArg":36,
      "NhLeu":37,
      "NhTrp":38,
      "Nhe":39,
      "Nma":40,
      "Nmfb":41,
      "Npcb":42,
      "Npe":43,
      "Npent":44,
      "Npfb":45,
      "Nphb":46,
      "Nphe":47,
      "Npmb":48,
      "Nprg":49,
      "NspepBr":50,
      "NspepCHthree":51,
      "NspepCl":52,
      "NspepF":53,
      "Nval":54
    }
  }
}